// src/components/About.js
import React from 'react';
import './css/about.css';

const About = () => {
    return (
        <div className="about">
            <h2>О нашем магазине</h2>
            <p>Волшебные миры, где пушистые комки счастья ждут своих новых хозяев,
                и яркие глаза, полные искренней любви — именно это предлагает наш
                интернет-магазин живых домашних животных! Здесь, в уютном пространстве
                виртуальной витрины, Вы найдете не просто четвероногих друзей, но верных
                спутников на многие года вперёд.</p>
            <p>Мы создали этот магазин, словно уютное гнездышко, где каждая собака и
                кошка — это история, стремящаяся к своему счастливому финалу. Каждый питомец,
                представленный на страницах нашего сайта, как индивидуальный персонаж в
                волшебной сказке: от игривых щенков, с блеском в глазах и хвостиками, словно флажками,
                до загадочных котят, способных заворожить своим умом и грацией.</p>
            <p>Мы гордимся тем, что заботимся о каждой жизни, которая пересекает наш путь — наши
                пушистые малыши выращиваются с любовью и вниманием. Мы тщательно отбираем домашних
                животных из проверенных питомников, предлагая только здоровых и счастливых животных.
                В нашем интернет-магазине Вы найдете множество пород — от экстравагантных самых
                известных до редких и необычных, как волшебные звезды, забытые в тени.</p>
            <p>Приглашаем Вас совершить это волшебное путешествие в мир домашних животных!
                Откройте для себя не просто интернет-магазин, а целую вселенную любви и тепла,
                где каждая лапка несёт надежду на новую жизнь. Пусть Ваш дом наполнится смехом,
                радостью и преданностью тех, кто станет Вашей настоящей семьей!</p>
        </div>
    );
};

export default About;
